examples/openfoam/example_pimpleFoamYade/0_org/U.fluid

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.fluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    y1 
    {
        type            fixedValue;
        value           uniform (2 0 0);
    }



    y0 
    {
        type            fixedValue;
        value           uniform (-2 0 0);
    }




    x0 
    {
        type            cyclic;
    
    }




    x1 
    {
        type            cyclic;
    
    }


    z1 
    {
        type            cyclic;
    
    }



    z0 
    {
        type            cyclic;
    
    }


}

// ************************************************************************* //
